app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `salt`, `created_at`, `activated_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `deleted_at`, `activation_code`, `phone_number`, `remember_token`, `login`, `email`, `state`) VALUES('', '700ac6430ecafe59b9c40cdce8e8033eef88af6c', '2010-06-05 05:09:42', NULL, 'bbe712e1d4e3895649283deebff0f01495ec9b4f', NULL, '2010-06-05 05:09:42', NULL, 'ce995bbcc8e5551370dbcfac6c0cc3caca8fab40', NULL, NULL, 'quire', 'quire@example.com', 'pending')
---
  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    @user.register! if @user && @user.valid?
    success = @user && @user.valid?

    house = @user.houses.new(params[:house])
    success = house && house.valid?

    if success && @user.errors.empty? && house.errors.empty?
      @user.save!

SELECT * FROM `users` WHERE (`users`.`activation_code` = '1b6453892473a467d07372d45eb05abc2031647a') LIMIT 1
---
  def activate
    logout_keeping_session!
    user = User.find_by_activation_code(params[:activation_code]) unless params[:activation_code].blank?